ArmstrongSubero/Embedded-Systems-Projects/GP01_IoT_Plant.X/PIC24_PIC33_I2C2.h
/*******************************************************************************
 * File: PIC24_PIC33_I2C.h
 * Author: Armstrong Subero (original Author unknown)
 * PIC: 24FJ128GB204 @ 32 MHz, 3.3v
 * Compiler: XC16 (Pro) (v1.31, MPLAX X v3.55)
 * Program Version: 1.1
 *                * Added comments
 *                * Added intermediate level functions
 *                * Modified to work on PIC24FJ128GB204
 *                * Modified to use I2C2 module
 *                * Changed types
 *                
 * Program Description: This Program allows setup for I2C on PIC24 and dsPIC33
 *                      microcontrollers.
 * 
 * Hardware Description: Standard connections as per MCC or PPS
 *                      
 * Created May 8th, 2017, 10:00 PM
 * 
 *
 * License:
 * 
 * "Copyright (c) 2017 Armstrong Subero ("AUTHORS")"
 * All rights reserved.
 *
 * Permission to use, copy, modify, and distribute this software and its
 * documentation for any purpose, without fee, and without written agreement is
 * hereby granted, provided that the above copyright notice, the following
 * two paragraphs and the authors appear in all copies of this software.
 *
 * IN NO EVENT SHALL THE "AUTHORS" BE LIABLE TO ANY PARTY for
 * DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT
 * OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN IF THE "AUTHORS"
 * HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * THE "AUTHORS" SPECIFICALLY DISCLAIMS ANY WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 * AND FITNESS for A PARTICULAR PURPOSE.  THE SOFTWARE PROVIDED HEREUNDER IS
 * ON AN "AS IS" BASIS, AND THE "AUTHORS" HAS NO OBLIGATION TO
 * PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS.
 *
 * Please maintain this header in its entirety when copying/modifying
 * these files.
 * 
 ******************************************************************************/

#include "dsPIC33_STD.h"
#include "mcc_generated_files/mcc.h"
#include <stdint.h>

// Used by writing string to I2C
#define PAGESIZE 16

// General High Level Functions
void I2C2_INIT(void);
void I2C2_IDLE(void);
    
void I2C2_Write(uint8_t devAddr,uint16_t regAddr,uint8_t data);
void I2C2_WriteBit(uint8_t devAddr, uint8_t regAddr, uint8_t bitNum, uint8_t data);
bool I2C2_WriteBits(uint8_t devAddr, uint8_t regAddr, uint8_t bitStart, uint8_t length, uint8_t data) ;
void I2C2_WriteBytes(uint8_t devAddr,uint8_t regAddr,uint8_t len,uint8_t *dptr);
void I2C2_WriteWord(uint8_t devAddr,uint8_t regAddr,uint16_t data);
uint8_t I2C2_Read(uint8_t devAddr,uint16_t regAddr);
uint8_t I2C2readBit(uint8_t devAddr, uint8_t regAddr, uint8_t bitNum, uint8_t *data);
uint8_t I2C2readBits(uint8_t devAddr, uint8_t regAddr, uint8_t bitStart, uint8_t length, uint8_t *data);
void I2C2readBytes(uint8_t devAddr,uint8_t regAddr,uint8_t len,uint8_t *dptr);
void I2C2_page_Write(unsigned char deviceId,unsigned char address,unsigned char len,unsigned char *dataptr);
void I2C2_page_Read(unsigned char deviceId,unsigned char address,unsigned char len,unsigned char *dataptr);

//High Level Functions for Low Density Devices
uint8_t LDByteReadI2C2(unsigned char, unsigned char, unsigned char*, unsigned char);
uint8_t LDByteWriteI2C2(unsigned char, unsigned char, unsigned char);
uint8_t LDPageWriteI2C2(unsigned char, unsigned char , unsigned char *,unsigned char );
uint8_t LDSequentialReadI2C2(unsigned char, unsigned char, unsigned char*, unsigned char);

//High Level Functions for High Density Devices
uint8_t HDByteReadI2C(unsigned char, unsigned char, unsigned char, unsigned char*, unsigned char);
uint8_t HDByteWriteI2C2(unsigned char, unsigned char, unsigned char, unsigned char);
uint8_t HDPageWriteI2C2(unsigned char , unsigned char , unsigned char, unsigned char*,unsigned char);
uint8_t HDSequentialReadI2C(unsigned char, unsigned char, unsigned char, unsigned char*, unsigned char);

// Intermediate Level Functions
char MasterWriteI2C2(unsigned char data_out);
char MasterReadI2C2(void);
    
//Low Level Functions
uint8_t IdleI2C2(void);
uint8_t StartI2C2(void);
uint8_t WriteI2C2(unsigned char);
uint8_t StopI2C2(void);
uint8_t RestartI2C2(void);
uint8_t getsI2C2(unsigned char*, unsigned char);
uint8_t NotAckI2C2(void);
uint8_t InitI2C2(void);
uint8_t ACKStatus2(void);
uint8_t getI2C2(void);
uint8_t AckI2C2(void);
uint8_t EEAckPolling2(unsigned char);
uint8_t putstringI2C2(unsigned char *,unsigned char );
    
